<?php
namespace flydes\Slug;

class Slug
{
    public static function make($str)
    {
        $trans_str = array(
            'й' => 'i', 'ц' => 'c', 'у' => 'u', 'к' => 'k', 'е' => 'e', 'н' => 'n',
            'г' => 'g', 'ш' => 'sh', 'щ' => 'shh', 'з' => 'z', 'х' => 'h', 'ъ' => '',
            'ф' => 'f', 'ы' => 'y', 'в' => 'v', 'а' => 'a', 'п' => 'p', 'р' => 'r',
            'о' => 'o', 'л' => 'l', 'д' => 'd', 'ж' => 'zh', 'э' => 'e', 'ё' => 'e',
            'я' => 'ya', 'ч' => 'ch', 'с' => 's', 'м' => 'm', 'и' => 'i', 'т' => 't',
            'ь' => '', 'б' => 'b', 'ю' => 'yu', 'Й' => 'I', 'Ц' => 'C', 'У' => 'U',
            'К' => 'K', 'Е' => 'E', 'Н' => 'N', 'Г' => 'G', 'Ш' => 'SH', 'З' => 'Z',
            'Х' => 'H', 'Ъ' => '', 'Ф' => 'F', 'Ы' => 'Y', 'В' => 'V', 'А' => 'A',
            'П' => 'P', 'Р' => 'R', 'О' => 'O', 'Л' => 'L', 'Д' => 'D', 'Ж' => 'ZH',
            'Э' => 'E', 'Ё' => 'E', 'Я' => 'YA', 'Ч' => 'CH', 'С' => 'S', 'М' => 'M',
            'И' => 'I', 'Т' => 'T', 'Ь' => '', 'Б' => 'B', 'Ю' => 'YU', 'Щ' => 'SHH',
            ' ' => '-'
        );

        preg_match('/[^A-Za-z0-9_\-]/', $str);
        $str = trim($str);
        $str = strtolower(strtr($str, $trans_str));
        $str = preg_replace('/[^A-Za-z0-9_\-]/', '', $str);
        $str = preg_replace('/[-_]{2,}/', '-', $str);

        $pos = substr($str, -1);

        if ($pos === '-' || $pos === '_') {
            $str = substr($str, 0, -1);
        }
        return $str;
    }
}

?>